import React from "react";

const Rouatna = () => {
  return (
    <>
      <section className="flex bg-[#fff] flex-col md:flex-row font-tajawal my-40 items-center gap-8 p-6">
        {/* الصورة */}

        {/* النص */}
        <div className="md:w-1/2 w-full text-right">
          <h2 className="text-4xl text-orange-400 font-bold mb-4"> رؤيتنا</h2>
          <p className="text-xl text-gray-700 leading-relaxed">
            نطمح لأن نكون المنصة الرائدة في المملكة العربية السعودية في مجال
            تمكين الأفراد من بناء سير ذاتية احترافية تعكس مؤهلاتهم وطموحاتهم
            وتفتح لهم أبواب الفرص الوظيفية والمهنية. نسعى إلى إحداث نقلة نوعية
            في ثقافة البحث عن العمل من خلال تقديم حلول رقمية ذكية تساعد كل فرد –
            سواء كان طالبًا، خريجًا، أو محترفًا – على إبراز هويته المهنية بأسلوب
            احترافي ومميز. تأتي رؤيتنا منسجمة مع مستهدفات رؤية السعودية 2030
            التي تركز على تطوير رأس المال البشري، ودعم الكفاءات الوطنية، وتعزيز
            فرص التوظيف في مختلف القطاعات. نؤمن بأن السيرة الذاتية ليست مجرد
            وثيقة، بل أداة فعالة لبناء المستقبل وصنع التأثير. نعمل على أن نكون
            جزءًا من رحلة التحول الوطني من خلال تمكين الأفراد، تعزيز الثقافة
            الرقمية، والمساهمة في رفع جاهزية الشباب لسوق العمل المحلي والعالمي.
            كما نلتزم بالابتكار المستمر في خدماتنا وأدواتنا، ونسعى لتقديم تجربة
            سلسة، عربية بالكامل، وذات جودة عالية تعكس تطلعات المستخدمين وتواكب
            طموح المملكة في بناء اقتصاد معرفي مزدهر
          </p>
        </div>
        <div className="md:w-1/2 w-full">
          <img
            src="/images/roya1.png" // عدّل المسار حسب صورتك
            alt="وصف الصورة"
            className="w-full h-auto rounded-xl "
          />
        </div>
      </section>
    </>
  );
};

export default Rouatna;
